from discord.ext import commands
from pykakasi import kakasi


class Kotoba(commands.Cog):
    def __init__(self, bot: commands.Bot):
        print('Ktoba OK')
        self.bot = bot
        self.kakasi = kakasi()

    @commands.command()
    async def boin(self, ctx, *, arg):
        # ルールに従って文字列を置換
        rep_word = str.maketrans({'ー': '〜', '-': '〜'})
        mojiretsu = arg.translate(rep_word)
        # Spoilerを解除
        mojiretsu = mojiretsu.replace('||', '')
        # 漢字・ひらがなをカタカナに変換
        self.kakasi.setMode('J', 'K')
        self.kakasi.setMode("H", "K")
        conv = self.kakasi.getConverter()
        katakana = conv.do(mojiretsu)
        text = katakana.translate(str.maketrans({"ﾟ": "", "ﾞ": ""}))
        # 大文字とゥの変換リスト
        large_tone = {
            'ア': 'ア', 'イ': 'イ', 'ウ': 'ウ', 'エ': 'エ', 'オ': 'オ',
            'ァ': 'ア', 'ィ': 'イ', 'ゥ': 'ウ', 'ェ': 'エ', 'ォ': 'オ',
            'ヴ': 'ウ',
            'カ': 'ア', 'キ': 'イ', 'ク': 'ウ', 'ケ': 'エ', 'コ': 'オ',
            'サ': 'ア', 'シ': 'イ', 'ス': 'ウ', 'セ': 'エ', 'ソ': 'オ',
            'タ': 'ア', 'チ': 'イ', 'ツ': 'ウ', 'テ': 'エ', 'ト': 'オ',
            'ッ': 'ウ',
            'ナ': 'ア', 'ニ': 'イ', 'ヌ': 'ウ', 'ネ': 'エ', 'ノ': 'オ',
            'ハ': 'ア', 'ヒ': 'イ', 'フ': 'ウ', 'ヘ': 'エ', 'ホ': 'オ',
            'マ': 'ア', 'ミ': 'イ', 'ム': 'ウ', 'メ': 'エ', 'モ': 'オ',
            'ヤ': 'ア', 'ユ': 'ウ', 'ヨ': 'オ',
            'ャ': 'ア', 'ュ': 'ウ', 'ョ': 'オ',
            'ラ': 'ア', 'リ': 'イ', 'ル': 'ウ', 'レ': 'エ', 'ロ': 'オ',
            'ワ': 'ア', 'ヰ': 'イ', '𛄢': 'ウ', 'ヱ': 'エ', 'ヲ': 'オ', 'ン': 'ン',
            'ヮ': 'ア',
            'ガ': 'ア', 'ギ': 'イ', 'グ': 'ウ', 'ゲ': 'エ', 'ゴ': 'オ',
            'ザ': 'ア', 'ジ': 'イ', 'ズ': 'ウ', 'ゼ': 'エ', 'ゾ': 'オ',
            'ダ': 'ア', 'ヂ': 'イ', 'ヅ': 'ウ', 'デ': 'エ', 'ド': 'オ',
            'バ': 'ア', 'ビ': 'イ', 'ブ': 'ウ', 'ベ': 'エ', 'ボ': 'オ',
            'パ': 'ア', 'ピ': 'イ', 'プ': 'ウ', 'ペ': 'エ', 'ポ': 'オ',
            'ｱ': 'ア', 'ｲ': 'イ', 'ｳ': 'ウ', 'ｴ': 'エ', 'ｵ': 'オ',
            'ｧ': 'ア', 'ｨ': 'イ', 'ｩ': 'ウ', 'ｪ': 'エ', 'ｫ': 'オ',
            'ｳﾞ': 'ウ',
            'ｶ': 'ア', 'ｷ': 'イ', 'ｸ': 'ウ', 'ｹ': 'エ', 'ｺ': 'オ',
            'ｻ': 'ア', 'ｼ': 'イ', 'ｽ': 'ウ', 'ｾ': 'エ', 'ｿ': 'オ',
            'ﾀ': 'ア', 'ﾁ': 'イ', 'ﾂ': 'ウ', 'ﾃ': 'エ', 'ﾄ': 'オ',
            'ｯ': 'ウ',
            'ﾅ': 'ア', 'ﾆ': 'イ', 'ﾇ': 'ウ', 'ﾈ': 'エ', 'ﾉ': 'オ',
            'ﾊ': 'ア', 'ﾋ': 'イ', 'ﾌ': 'ウ', 'ﾍ': 'エ', 'ﾎ': 'オ',
            'ﾏ': 'ア', 'ﾐ': 'イ', 'ﾑ': 'ウ', 'ﾒ': 'エ', 'ﾓ': 'オ',
            'ﾔ': 'ア', 'ﾕ': 'ウ', 'ﾖ': 'オ',
            'ｬ': 'ア', 'ｭ': 'ウ', 'ｮ': 'オ',
            'ﾗ': 'ア', 'ﾘ': 'イ', 'ﾙ': 'ウ', 'ﾚ': 'エ', 'ﾛ': 'オ',
            'ﾜ': 'ア', 'ｦ': 'オ', 'ﾝ': 'ン',
            'ｶﾞ': 'ア', 'ｷﾞ': 'イ', 'ｸﾞ': 'ウ', 'ｹﾞ': 'エ', 'ｺﾞ': 'オ',
            'ｻﾞ': 'ア', 'ｼﾞ': 'イ', 'ｽﾞ': 'ウ', 'ｾﾞ': 'エ', 'ｿﾞ': 'オ',
            'ﾀﾞ': 'ア', 'ﾁﾞ': 'イ', 'ﾂﾞ': 'ウ', 'ﾃﾞ': 'エ', 'ﾄﾞ': 'オ',
            'ﾊﾞ': 'ア', 'ﾋﾞ': 'イ', 'ﾌﾞ': 'ウ', 'ﾍﾞ': 'エ', 'ﾎﾞ': 'オ',
            'ﾊﾟ': 'ア', 'ﾋﾟ': 'イ', 'ﾌﾟ': 'ウ', 'ﾍﾟ': 'エ', 'ﾎﾟ': 'オ'
        }

        # 大文字を母音に変換
        text = list(text)
        for i, v in enumerate(text):
            if v in large_tone:
                text[i] = large_tone[v]
        text = ''.join(text)

        # 残った小文字を母音に変換
        # for k,v in zip('ヮャュョッ','アアウオウ'):
        #     text = text.replace(k,v)
        if text == "":
            await ctx.send('変換したら文字なくなちゃった (*ﾉω・*)ﾃﾍ')
            return

        await ctx.send(text)


def setup(bot):
    bot.add_cog(Kotoba(bot))
